Cases/container/container_solar_copy/constant/airOutside/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

air
{
    type        transparent;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0 0);
        emissivity      (0 0);
    }
}

bottom
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.9 0.9);
        emissivity      (0.9 0.9);
    };
}

airOutside_to_airInside
{
type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.7 0.7);
        emissivity      (0.7 0.7);
    };
}

// ************************************************************************* //
